OdDAI.AttributeDataLogic.destroy(System.Void*)
\details
Calls destructor on the object defined by its type.
\param createdObjectMemory       [in] Object to destroy.

OdDAI.AttributeDataLogic.test(System.Void*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Checks whether the specified data is unset.
\param what       [in] Data to test.
\param attribute  [in] Attribute.
\returns true if the provided data is not unset; otherwise the method returns false.

OdDAI.AttributeDataLogic.unset(System.Void*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Unsets the specified data.
\param what       [in] Data to unset.
\param attribute  [in] Attribute.

OdDAI.AttributeDataLogic.set(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Void*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Sets data from the specified value.
\param from       [in] Source.
\param to         [out] Destination.
\param attribute  [in] Attribute.
\returns true if set successfully; otherwise the method returns false.

OdDAI.AttributeDataLogic.get(System.Void*,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Gets data from the specified value.
\param from       [in] Source.
\param to         [out] Destination.
\param attribute  [in] Attribute.

OdDAI.AttributeDataLogic.write(System.Void*,OdDAI.OdSpfFilerBase*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Writes data to a filer.
\param what       [in] Data to write.
\param rdFiler    [in/out] Filer to write to.
\param attribute  [in] Attribute.

OdDAI.AttributeDataLogic.read(System.Void*,OdDAI.OdSpfFilerBase*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Reads data from a filer.
\param what       [in/out] Data of a specific type for a filer to read.
\param rdFiler    [in] Filer to read from.
\param attribute  [in] Attribute.

OdDAI.AttributeDataLogic.copy(System.Void*,System.Void*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Copies attribute data.
\param from       [in] Source.
\param to         [in] Destination.
\param attribute  [in] Attribute.
\returns true if copied successfully; otherwise the method returns false;

OdDAI.AttributeDataLogic.compare(System.Void*,System.Void*,OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*)
\details
Compares left data to right data of an attribute.
\param left       [in] Left data to compare.
\param right      [in] Right data to compare.
\param attribute  [in] Attribute.
\returns true if the provided data is equal; otherwise the method returns false;

OdDAI.AttributeDataLogic.Dispose
\details
Virtual destructor.

OdDAI.AttributeDataLogic
\details
This class provides a set of operations for working with attribute data.